y1s1/cy1601-math-1/module-1b/notes.org
#+TITLE: Math Module 1B Lecture Notes
#+AUTHOR: Hankertrix
#+STARTUP: showeverything
#+OPTIONS: toc:2
#+LATEX_HEADER: \usepackage{array, tikz, pgfplots}

\newpage

* Limits

** The idea of limit

Let \(f(x) = \frac{\sin x}{x}\). What happens to $f(x)$ of values of $x$ near 0?

We can observe that:

\begin{center}
\begin{tabular}{c c|c c}
x & f(x) & x & f(x) \\
\hline
0.1 & 0.998 & -0.1 & -0.998 \\
0.01 & 0.99998 & -0.01 & 0.99998 \\
0.001 & 0.9999998 & -0.001 & 0.9999998 \\
0.0001 & 0.999999998 & -0.0001 & 0.999999998
\end{tabular}
\end{center}

It *looks like* the function values of $f(x)$ get closer and closer to 1 as $x$ approaches 0.


** Plotting approach

We can plot the graph:
\\
\\

\begin{tikzpicture}
\begin{axis}[axis lines = middle, xmin = -6, xmax = 6, ymin = -10, ymax = 10]
\addplot[color = red]{x / sin(deg(x))};
\end{axis}
\end{tikzpicture}

\newpage

** Limits, in rigorous terms
From a maths perspective, "*looks like*" isn't good enough.
\\

But before we can do anything better, we have to *exactly define* what we're talking about in the first place.
\\

Roughly speaking, if $f(x)$ can be made arbitrarily close to some number $L$ by taking the value of the variable $x$ sufficiently close to $a$, but not equal to $a$, then we'd like to say that $L$ is $f$'s limit at the point \(a\).
\\

In simpler terms, if $f(x)$ approaches a value $L$ but isn't equal to $L$, that means that $L$ is $f$'s limit.


** Distance between points

*** Definition
The distance between two points $x, y \in \mathbb{R}$ is $|x - y|$.

*** Examples
The distance between 5 and 7 is $7 - 5 = 2$.
\\

The distance between 7 and 5 is also $7 - 5 = 2$.


*** Thinking in distances

For expressions such as the one below:

\begin{equation*}
|x - a| < \delta, \, (\delta > 0)
\end{equation*}

It is usually helpful to think of these expressions in terms of distances, i.e. "the point $x$ is within distance $\delta$ from \(a\)". Note that for \(\delta > 0\):

\begin{equation}
|x - a| < \delta \Leftrightarrow x \in (a - \delta, a + \delta)
\end{equation}

\newpage

** Limit points

*** Definition
Let $A$ be a subset of $\mathbb{R}$. We say that a point $a \in \mathbb{R}$ is a *limit point* of $A$, if for every $\delta > 0$, there exists a point $x \in A$ such that $0 < |x - a| < \delta$.
\\

Basically, this means that $a$ is a limit point of $A$ if there is a point $x$ such that $0 < |x - a| < \delta$, or that the absolute value of $x - a$ is between $0$ and $\delta$.


*** Example 1
Consider \(A = (0, 1] \cup {2}\).
\\
\\

\begin{tikzpicture}[scale = 2]

% The red line representing the range
\draw[color = red, very thick] (0,0) -- (1,0);
\draw[color = blue, very thick] (2.5,0) -- (3.5,0);

% The circles representing the points
\path [draw=red, fill=red] (1,0) circle (2pt);
\path [draw=red, fill=white, thick] (0,0) circle (2pt);
\path [draw=red, fill=red] (2,0) circle (2pt);
\path [draw=blue, fill=white, thick] (2.5,0) circle (2pt);
\path [draw=blue, fill=white, thick] (3.5,0) circle (2pt);

% The number line
\draw[latex-latex] (-1.5,0) -- (4.5,0) ;
\foreach \x in {-1,0,1,2,3,4}
\draw[shift={(\x,0)},color=black] (0pt,3pt) -- (0pt,-3pt);
\foreach \x in {-1,0,1,2,3,4}
\draw[shift={(\x,0)},color=black] (0pt,0pt) -- (0pt,-3pt) node[below]
{$\x$};

% The labels for a and a - δ
\node [below, color=blue] at (2.5,-0.1) {$a - \delta$};
\node [above, color=blue] at (3,0.1) {$a$};
\node [below, color=blue] at (3.5,-0.1) {$a + \delta$};
\end{tikzpicture}
\\

Is 3 a limit point of $A$?
\\

From the definition of the limit point of \(A\), $a \in \mathbb{R}$ is a limit point of $a$ if for every $\delta > 0$, there exists a $x \in A$ such that $0 < |x - a| < \delta$.
\\

Let \(\delta = \frac{1}{2}\). At \(a = 3\), there does not exist $x \in A$ such that \(0 < |x - a| < \delta\). Hence, $a = 3$ is *not* a limit point of $A$.

\newpage

*** Example 2
Consider \(A = (0, 1] \cup {2}\).
\\
\\

\begin{tikzpicture}[scale = 2]

% The red line representing the range
\draw[color = red, very thick] (0,0) -- (1,0);
\draw[color = blue, very thick] (1.5,0) -- (2.5,0);

% The circles representing the points
\path [draw=red, fill=red] (1,0) circle (2pt);
\path [draw=red, fill=white, thick] (0,0) circle (2pt);
\path [draw=red, fill=red] (2,0) circle (2pt);
\path [draw=blue, fill=white, thick] (1.5,0) circle (2pt);
\path [draw=blue, fill=white, thick] (2.5,0) circle (2pt);

% The number line
\draw[latex-latex] (-1.5,0) -- (4.5,0) ;
\foreach \x in {-1,0,1,2,3,4}
\draw[shift={(\x,0)},color=black] (0pt,3pt) -- (0pt,-3pt);
\foreach \x in {-1,0,1,2,3,4}
\draw[shift={(\x,0)},color=black] (0pt,0pt) -- (0pt,-3pt) node[below]
{$\x$};

% The labels for a and a - δ
\node [below, color=blue] at (1.5,-0.1) {$a - \delta$};
\node [above, color=blue] at (2,0.1) {$a$};
\node [below, color=blue] at (2.5,-0.1) {$a + \delta$};
\end{tikzpicture}
\\

Is 2 a limit point of $A$?
\\

From the definition of the limit point of \(A\), $a \in \mathbb{R}$ is a limit point of $a$ if for every $\delta > 0$, there exists a $x \in A$ such that $0 < |x - a| < \delta$.
\\

Let \(\delta = \frac{1}{2}\). At \(a = 2\), there does not exist $x \in A$ such that \(0 < |x - a| < \delta\). Hence, $a = 2$ is *not* a limit point of $A$.


*** Example 3
Consider \(A = (0, 1] \cup {2}\).
\\
\\

\begin{tikzpicture}[scale = 2]

% The red line representing the range
\draw[color = red, very thick] (0,0) -- (1,0);
\draw[color = blue, very thick] (0.5,0) -- (1.5,0);

% The circles representing the points
\path [draw=red, fill=red] (1,0) circle (2pt);
\path [draw=red, fill=white, thick] (0,0) circle (2pt);
\path [draw=red, fill=red] (2,0) circle (2pt);
\path [draw=blue, fill=white, thick] (0.5,0) circle (2pt);
\path [draw=blue, fill=white, thick] (1.5,0) circle (2pt);

% The number line
\draw[latex-latex] (-1.5,0) -- (4.5,0) ;
\foreach \x in {-1,0,1,2,3,4}
\draw[shift={(\x,0)},color=black] (0pt,3pt) -- (0pt,-3pt);
\foreach \x in {-1,0,1,2,3,4}
\draw[shift={(\x,0)},color=black] (0pt,0pt) -- (0pt,-3pt) node[below]
{$\x$};

% The labels for a and a - δ
\node [below, color=blue] at (0.5,-0.1) {$a - \delta$};
\node [above, color=blue] at (1,0.1) {$a$};
\node [below, color=blue] at (1.5,-0.1) {$a + \delta$};
\end{tikzpicture}
\\

Is 1 a limit point of $A$?
\\

From the definition of the limit point of \(A\), $a \in \mathbb{R}$ is a limit point of $a$ if for every $\delta > 0$, there exists a $x \in A$ such that $0 < |x - a| < \delta$.
\\

Let \(\delta > 0\). At \(a = 1\), there exists a $x \in A$ such that \(0 < |x - a| < \delta\). Hence, $a = 1$ *is* a limit point of $A$.
\\

$\frac{1}{2}$ and 0 is also a limit point of $A$.

\newpage

