y1s1/cy1601-math-1/module-1b/notes.tex
% Created 2023-08-29 Tue 12:37
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{array, tikz, pgfplots}
\author{Hankertrix}
\date{\today}
\title{Math Module 1B Lecture Notes}
\hypersetup{
 pdfauthor={Hankertrix},
 pdftitle={Math Module 1B Lecture Notes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.1 (Org mode 9.6.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\setcounter{tocdepth}{2}
\tableofcontents

\newpage

\section{Limits}
\label{sec:org803a9e2}

\subsection{The idea of limit}
\label{sec:orgbe71e73}

Let \(f(x) = \frac{\sin x}{x}\). What happens to \(f(x)\) of values of \(x\) near 0?

We can observe that:

\begin{center}
\begin{tabular}{c c|c c}
x & f(x) & x & f(x) \\
\hline
0.1 & 0.998 & -0.1 & -0.998 \\
0.01 & 0.99998 & -0.01 & 0.99998 \\
0.001 & 0.9999998 & -0.001 & 0.9999998 \\
0.0001 & 0.999999998 & -0.0001 & 0.999999998
\end{tabular}
\end{center}

It \textbf{looks like} the function values of \(f(x)\) get closer and closer to 1 as \(x\) approaches 0.


\subsection{Plotting approach}
\label{sec:org7bab5ca}

We can plot the graph:
\\[0pt]
\\[0pt]

\begin{tikzpicture}
\begin{axis}[axis lines = middle, xmin = -6, xmax = 6, ymin = -10, ymax = 10]
\addplot[color = red]{x / sin(deg(x))};
\end{axis}
\end{tikzpicture}

\newpage

\subsection{Limits, in rigorous terms}
\label{sec:orgfdcef37}
From a maths perspective, "\textbf{looks like}" isn't good enough.
\\[0pt]

But before we can do anything better, we have to \textbf{exactly define} what we're talking about in the first place.
\\[0pt]

Roughly speaking, if \(f(x)\) can be made arbitrarily close to some number \(L\) by taking the value of the variable \(x\) sufficiently close to \(a\), but not equal to \(a\), then we'd like to say that \(L\) is \(f\)'s limit at the point \(a\).
\\[0pt]

In simpler terms, if \(f(x)\) approaches a value \(L\) but isn't equal to \(L\), that means that \(L\) is \(f\)'s limit.


\subsection{Distance between points}
\label{sec:org49d12fc}

\subsubsection{Definition}
\label{sec:org15295e6}
The distance between two points \(x, y \in \mathbb{R}\) is \(|x - y|\).

\subsubsection{Examples}
\label{sec:org0e72403}
The distance between 5 and 7 is \(7 - 5 = 2\).
\\[0pt]

The distance between 7 and 5 is also \(7 - 5 = 2\).


\subsubsection{Thinking in distances}
\label{sec:org3e9849d}

For expressions such as the one below:

\begin{equation*}
|x - a| < \delta, \, (\delta > 0)
\end{equation*}

It is usually helpful to think of these expressions in terms of distances, i.e. "the point \(x\) is within distance \(\delta\) from \(a\)". Note that for \(\delta > 0\):

\begin{equation}
|x - a| < \delta \Leftrightarrow x \in (a - \delta, a + \delta)
\end{equation}

\newpage

\subsection{Limit points}
\label{sec:orga8efeb7}

\subsubsection{Definition}
\label{sec:org4ed76d7}
Let \(A\) be a subset of \(\mathbb{R}\). We say that a point \(a \in \mathbb{R}\) is a \textbf{limit point} of \(A\), if for every \(\delta > 0\), there exists a point \(x \in A\) such that \(0 < |x - a| < \delta\).
\\[0pt]

Basically, this means that \(a\) is a limit point of \(A\) if there is a point \(x\) such that \(0 < |x - a| < \delta\), or that the absolute value of \(x - a\) is between \(0\) and \(\delta\).


\subsubsection{Example 1}
\label{sec:org555ccef}
Consider \(A = (0, 1] \cup {2}\).
\\[0pt]
\\[0pt]

\begin{tikzpicture}[scale = 2]

% The red line representing the range
\draw[color = red, very thick] (0,0) -- (1,0);
\draw[color = blue, very thick] (2.5,0) -- (3.5,0);

% The circles representing the points
\path [draw=red, fill=red] (1,0) circle (2pt);
\path [draw=red, fill=white, thick] (0,0) circle (2pt);
\path [draw=red, fill=red] (2,0) circle (2pt);
\path [draw=blue, fill=white, thick] (2.5,0) circle (2pt);
\path [draw=blue, fill=white, thick] (3.5,0) circle (2pt);

% The number line
\draw[latex-latex] (-1.5,0) -- (4.5,0) ;
\foreach \x in {-1,0,1,2,3,4}
\draw[shift={(\x,0)},color=black] (0pt,3pt) -- (0pt,-3pt);
\foreach \x in {-1,0,1,2,3,4}
\draw[shift={(\x,0)},color=black] (0pt,0pt) -- (0pt,-3pt) node[below]
{$\x$};

% The labels for a and a - δ
\node [below, color=blue] at (2.5,-0.1) {$a - \delta$};
\node [above, color=blue] at (3,0.1) {$a$};
\node [below, color=blue] at (3.5,-0.1) {$a + \delta$};
\end{tikzpicture}
\\[0pt]

Is 3 a limit point of \(A\)?
\\[0pt]

From the definition of the limit point of \(A\), \(a \in \mathbb{R}\) is a limit point of \(a\) if for every \(\delta > 0\), there exists a \(x \in A\) such that \(0 < |x - a| < \delta\).
\\[0pt]

Let \(\delta = \frac{1}{2}\). At \(a = 3\), there does not exist \(x \in A\) such that \(0 < |x - a| < \delta\). Hence, \(a = 3\) is \textbf{not} a limit point of \(A\).

\newpage

\subsubsection{Example 2}
\label{sec:org510e8c6}
Consider \(A = (0, 1] \cup {2}\).
\\[0pt]
\\[0pt]

\begin{tikzpicture}[scale = 2]

% The red line representing the range
\draw[color = red, very thick] (0,0) -- (1,0);
\draw[color = blue, very thick] (1.5,0) -- (2.5,0);

% The circles representing the points
\path [draw=red, fill=red] (1,0) circle (2pt);
\path [draw=red, fill=white, thick] (0,0) circle (2pt);
\path [draw=red, fill=red] (2,0) circle (2pt);
\path [draw=blue, fill=white, thick] (1.5,0) circle (2pt);
\path [draw=blue, fill=white, thick] (2.5,0) circle (2pt);

% The number line
\draw[latex-latex] (-1.5,0) -- (4.5,0) ;
\foreach \x in {-1,0,1,2,3,4}
\draw[shift={(\x,0)},color=black] (0pt,3pt) -- (0pt,-3pt);
\foreach \x in {-1,0,1,2,3,4}
\draw[shift={(\x,0)},color=black] (0pt,0pt) -- (0pt,-3pt) node[below]
{$\x$};

% The labels for a and a - δ
\node [below, color=blue] at (1.5,-0.1) {$a - \delta$};
\node [above, color=blue] at (2,0.1) {$a$};
\node [below, color=blue] at (2.5,-0.1) {$a + \delta$};
\end{tikzpicture}
\\[0pt]

Is 2 a limit point of \(A\)?
\\[0pt]

From the definition of the limit point of \(A\), \(a \in \mathbb{R}\) is a limit point of \(a\) if for every \(\delta > 0\), there exists a \(x \in A\) such that \(0 < |x - a| < \delta\).
\\[0pt]

Let \(\delta = \frac{1}{2}\). At \(a = 2\), there does not exist \(x \in A\) such that \(0 < |x - a| < \delta\). Hence, \(a = 2\) is \textbf{not} a limit point of \(A\).


\subsubsection{Example 3}
\label{sec:org2c12dda}
Consider \(A = (0, 1] \cup {2}\).
\\[0pt]
\\[0pt]

\begin{tikzpicture}[scale = 2]

% The red line representing the range
\draw[color = red, very thick] (0,0) -- (1,0);
\draw[color = blue, very thick] (0.5,0) -- (1.5,0);

% The circles representing the points
\path [draw=red, fill=red] (1,0) circle (2pt);
\path [draw=red, fill=white, thick] (0,0) circle (2pt);
\path [draw=red, fill=red] (2,0) circle (2pt);
\path [draw=blue, fill=white, thick] (0.5,0) circle (2pt);
\path [draw=blue, fill=white, thick] (1.5,0) circle (2pt);

% The number line
\draw[latex-latex] (-1.5,0) -- (4.5,0) ;
\foreach \x in {-1,0,1,2,3,4}
\draw[shift={(\x,0)},color=black] (0pt,3pt) -- (0pt,-3pt);
\foreach \x in {-1,0,1,2,3,4}
\draw[shift={(\x,0)},color=black] (0pt,0pt) -- (0pt,-3pt) node[below]
{$\x$};

% The labels for a and a - δ
\node [below, color=blue] at (0.5,-0.1) {$a - \delta$};
\node [above, color=blue] at (1,0.1) {$a$};
\node [below, color=blue] at (1.5,-0.1) {$a + \delta$};
\end{tikzpicture}
\\[0pt]

Is 1 a limit point of \(A\)?
\\[0pt]

From the definition of the limit point of \(A\), \(a \in \mathbb{R}\) is a limit point of \(a\) if for every \(\delta > 0\), there exists a \(x \in A\) such that \(0 < |x - a| < \delta\).
\\[0pt]

Let \(\delta > 0\). At \(a = 1\), there exists a \(x \in A\) such that \(0 < |x - a| < \delta\). Hence, \(a = 1\) \textbf{is} a limit point of \(A\).
\\[0pt]

\(\frac{1}{2}\) and 0 is also a limit point of \(A\).

\newpage
