y1s1/cy1601-math-1/module-1b/notes.org
** Definition of a limit
For a function $f: A \rightarrow \mathbb{R}, \, A \subset \mathbb{R}$ with $a$ as a limit point of $A$, $f$ approaches a *limit* $L$ if for every $\varepsilon > 0$, there exists a $\delta > 0$ such that:

\[\lim_{x \rightarrow a} f(x) = L\]
\[\Updownarrow\]

For every $\varepsilon > 0$, there exists a $\delta > 0$ such that:
\[0 < |x - a| < \delta, \quad x \in A \ \ \Rightarrow \ \ |f(x) - L| < \varepsilon.\]

For a visual example, visit this [[https://www.desmos.com/calculator/fmcqwj1ama][link]].
\\

This [[https://www.khanacademy.org/math/ap-calculus-ab/ab-limits-new/ab-limits-optional/v/limit-intuition-review][playlist]] should help you understand the definition of a limit if the definition above still doesn't make any sense to you.

*** Example 1

Prove that \(\lim_{x \rightarrow 2} \, 17x = 34\).
\\

We want to show that for every $\varepsilon > 0$, there exists $\delta > 0$, such that:
\[0 < |x - 2| < \delta, \quad x \in \mathbb{R} \ \ \Rightarrow \ \ |17x - 34| < \varepsilon\]

Hence:
\[|17x - 34| = 17|x - 2|\]
\[17|x - 2| < \varepsilon\]
\[|x - 2| < \frac{\varepsilon}{17}\]

Thus, we will need $\delta = \frac{\varepsilon}{17}$.
\\

Let $\varepsilon > 0$. If we choose $\delta = \frac{\varepsilon}{17}$, we have:
\[0 < |x - 2| < \delta \ \ \Rightarrow \ \ |17x - 34| = 17|x - 2| < 17\delta = \varepsilon\]

So, by definition,
\[\lim_{x \rightarrow 2} 17x = 34 \textbf{ (Proven)}\]

\newpage

*** Example 2

Prove that \(\lim_{x \rightarrow 0} \, x \sin \frac{1}{x} = 0\).
\\

We want to show that for every $\varepsilon > 0$, there exists a $\delta > 0$ such that:
\[0 < |x - 0| < \delta, \quad x \in \mathbb{R} \ \ \Rightarrow \ \ \left|x \sin \frac{1}{x} - 0 \right| < \varepsilon\]

Hence:
\[|x \sin \frac{1}{x}| = |x| \cdot |\sin \frac{1}{x}|\]

\begin{align*}
|x| \cdot |\sin \frac{1}{x}| &\leq |x| \\
&< \delta = \varepsilon
\end{align*}

Thus, we will need $\delta = \varepsilon$.
\\

Let $\varepsilon > 0$. If we choose $\delta = \varepsilon$, we have:
\begin{align*}
0 < |x - 0| < \delta &\Rightarrow \left|x \sin \frac{1}{x} - 0 \right| \\
&\Rightarrow |x| \cdot \left|\sin \frac{1}{2} \right| \leq |x| < \delta = \varepsilon
\end{align*}

So, by definition,
\[\lim_{x \rightarrow 0} x \sin \frac{1}{x} = 0 \textbf{ (Proven)}\]

\newpage

*** Example 3
Prove that \(\lim_{x \rightarrow 2} \, x^2 = 4\).
\\

We want to show that for every $\varepsilon > 0$, there exists a $\delta > 0$ such that:
\[0 < |x - 2| < \delta, \quad x \in \mathbb{R} \ \ \Rightarrow \ \ |x^2 - 4| < \varepsilon\]

Hence:
\[|x^2 - 4| = |x + 2| \cdot | x - 2| < 5|x - 2|\]
\[5|x - 2| < \varepsilon\]
\[|x - 2| < \frac{\varepsilon}{5}\]

If \(|x - 2| < 1\), then \(x \in (1,3)\), so \(|x + 2| < 5\).
\\

Thus, we will need \(\delta = min\{1, \frac{\varepsilon}{5}\} > 0\).

Let $\varepsilon > 0$. If we choose $\delta = min\{1, \frac{\varepsilon}{5}\}$, we have:
\[0 < |x - 2| < \delta \quad \Rightarrow \quad |x - 2| < \frac{\varepsilon}{5}\]

And

\begin{align*}
|x - 2| < 1 \quad &\Rightarrow \quad |x^2 - 4| = \begin{aligned}[t]
&|x + 2| \cdot |x - 2| < 5|x - 2| \\
&\because \ |x - 2| < 1 \ \ \text{so} \ \ x \in (1, 3) \\
& \quad \text{and } |x + 2| < 5
\end{aligned} \\
\\
&\Rightarrow \quad |x^2 - 4| < \begin{aligned}[t]
5|x - 2| < \varepsilon \quad \because \ |x - 2| < \frac{\varepsilon}{5}
\end{aligned}
\end{align*}
\\

Note that the $\because$ stands for because.
\\

So, by definition:
\[\lim_{x \rightarrow 2} x^2 = 4 \textbf{ (Proven)}\]


*** Limits are independent of function values
It is very important to realise that, given a function $f(x)$, the value $f(a)$ does not affect the limit \(\lim_{x \rightarrow a} \, f(x)\). To actually find this limit, we don't need to consider $f(a)$ and we don't care about whether $f(a)$ is defined.
\\

If there *exists* a number $L \in \mathbb{R}$ such that \(\lim_{x \rightarrow a} \, f(x) = L\), we say that *"f(x) has a limit as $x$ approaches $a$"* or that *"the limit $\lim_{x \rightarrow a} \, f(x)$ exists"*.
\\

On the contrary, if no such $L \in \mathbb{R}$ exists, we say that *"$f(x)$ has no limit as $x$ approaches $a$"* or that *"the limit $\lim_{x \rightarrow a} \, f(x)$ does not exist"*.
\\

Note that this has *nothing to do* with whether or not $L = 0$. A zero limit is still a limit.

\newpage

** Limit Laws

*** Theorem
Consider \(f : A_1 \rightarrow \mathbb{R}, g : A_2 \rightarrow \mathbb{R}\). Suppose $a$ is a limit point of $A_1 \cap A_2$, and \(\lim_{x \rightarrow a} \, f(x) = l, \lim_{x \rightarrow a} \, g(x) = m\), then:

\begin{align*}
\textbf{1. } \lim_{x \rightarrow a}(Af(x) + Bg(x)) &= Al + Bm \\
&= A \cdot \lim_{x \rightarrow a} f(x) + B \cdot \lim_{x \rightarrow a} g(x)
\end{align*}

\begin{align*}
\textbf{2. } \lim_{x \rightarrow a}(f(x) g(x)) &= lm \\
&= \lim_{x \rightarrow a} f(x) \cdot \lim_{x \rightarrow a} g(x)
\end{align*}

\begin{align*}
\textbf{3. } \lim_{x \rightarrow a} \frac{f(x)}{g(x)} &= \frac{l}{m},
\text{ provided } m \neq 0 \\
&= \frac{\lim_{x \rightarrow a} f(x)}{\lim_{x \rightarrow a} g(x)}
\end{align*}

\begin{align*}
\textbf{4. } \lim_{x \rightarrow a} \sqrt[n]{f(x)} &= \sqrt[n]{l},
\text{ provided } n \in \mathbb{N} \text{ and } l \ge 0 \text{ if } n \text{ is even} \\
&= \sqrt[n]{\lim_{x \rightarrow a} f(x)}
\end{align*}

*5.* L'H\(\text{\^o}\)pital's rule:
\[\lim_{x \rightarrow a} \frac{f(x)}{g(x)} = \lim_{x \rightarrow a} \frac{f'(x)}{g'(x)}, \text{ when } \lim_{x \rightarrow a} \frac{f(x)}{g(x)} = \frac{0}{0} \text{ and } g'(x) \neq 0\]

\newpage

*** Proof of \(\lim_{x \rightarrow a}(Af(x) + Bg(x)) = Al + Bm\)

Suppose that:
\[\lim_{x \rightarrow a}f(x) = l, \ \lim_{x \rightarrow a} = m.\]

Let $\varepsilon > 0$. By our assumptions, there exists a $\delta_1, \delta_2 > 0$ such that:
\[0 < |x - a| < \delta_1, \ x \in A_1, \quad \Rightarrow \quad |f(x) - l| < \frac{\varepsilon}{2(|A| + 1)},\]
\[0 < |x - a| < \delta_2, \ x \in A_2, \quad \Rightarrow \quad |g(x) -m| < \frac{\varepsilon}{2(|B| + 1)}\]

Let $\delta = min \{\delta_1, \delta_2\}$. Then:
\[0 < |x - a| < \delta, \ x \in A_1 \cap A_2\]
\[\Downarrow\]
\[0 < |x - a| < \delta_1 \ x \in A_1\]
\[0 < |x - a| < \delta_2 \ x \in A_2\]

\[\Downarrow\]
\begin{align*}
|Af(x) + Bg(x) - (Al + Bm)| &\le |A||f(x) - l| + |B||g(x) -m| \\
&< \frac{\varepsilon}{2} \frac{|A|}{|A| + 1} + \frac{\varepsilon}{2} \frac{|B|}{2|B| + 1} \\
&< \varepsilon
\end{align*}

The proofs for the other laws are also quite similar.

\newpage

