y1s1/cy1601-math-1/module-1b/notes.org
*** Deriving the limits of polynomials

Proving \(\lim_{x \rightarrow a} = a\):
\\

For $\varepsilon > 0$, let $\delta = \varepsilon$. Then:
\[0 < |x - a| < \delta \Rightarrow |x - a| < \delta = \varepsilon,\]

So, \(\lim_{x \rightarrow a} x = a\).
\\

Proving \(\lim_{x \rightarrow a} 1 = 1\):
\\

For $\varepsilon > 0$, let $\delta = 1$. Then:
\[0 < |x - a| < \delta \Rightarrow |1 - 1| < 0 < \varepsilon,\]

So, \(\lim_{x \rightarrow a} 1 = 1\).
\\

Then, using \(\lim_{x \rightarrow a}(Af(x) + Bg(x)) = Al + Bm\) that we just proved, we can conclude that:

\begin{align*}
\lim_{x \rightarrow a} (c_1x + c_0) &= \lim_{x \rightarrow a}(c_1x + c_0 \cdot 1 \\
&= c_1a + c_0
\end{align*}

Also, using \(\lim_{x \rightarrow a} f(x)g(x) = lm\), we can conclude that:

\begin{align*}
\lim_{x \rightarrow a} x^2 &= \lim_{x \rightarrow a} x \cdot x \\
&= a \cdot a \\
&= a^2
\end{align*}

Using \(\lim_{x \rightarrow a}(Af(x) + Bg(x)) = Al + Bm\) again, we can get:
\[\lim_{x \rightarrow a}(c_2 x^2 + c_1 x + c_0) = c_2 a^2 + c_1 a + c_0\]

Repeating this argument, we get that for any *polynomial \(p(x)\)*:
\[p(x) = c_n x^n + c_{n - 1} x^{n - 1} + \ldots + c_2 x^2 + c_1 x + c_0,\]

We have:
\begin{align*}
\lim_{x \rightarrow a}p(x) &= c_n a^n + c_{n - 1} a^{n-1} + \ldots + c_2 a^2 + c_1 a + c_0) \\
&= p(a)
\end{align*}

This property also holds for some other functions as well, as long as $a$ is in the domain of the function. A few examples are:
\[\text{1. } \lim_{x \rightarrow a} \sin x = \sin a\]
\[\text{2. } \lim_{x \rightarrow a} \cos x = \cos a\]
\[\text{3. } \lim_{x \rightarrow a}  e^x = e^a\]
\[\text{4. } \lim_{x \rightarrow a}  \ln x = \ln a\]

A function with this property is said to be *continuous*.

*** Reformulated limit laws
In each of the laws below, the equation only applies *if the limit on the right-hand side exists and the expression makes sense*. Otherwise, you cannot directly apply the laws below.

\[\text{1. }\lim_{x \rightarrow a}(Af(x) + Bg(x)) = A \lim_{x \rightarrow a}f(x) + B \lim_{x \rightarrow a} g(x)\]
\[\text{2. } \lim_{x \rightarrow a}(f(x) g(x)) = \lim_{x \rightarrow a} f(x) \cdot \lim_{x \rightarrow a} g(x)\]
\[\text{3. } \lim_{x \rightarrow a} \frac{f(x)}{g(x)} = \frac{\lim_{x \rightarrow a} f(x)}{\lim_{x \rightarrow a} g(x)}\]
\[\text{4. } \lim_{x \rightarrow a} \sqrt[n]{f(x)} = \sqrt[n]{\lim_{x \rightarrow a} f(x)}\]
\[\text{5. } \lim_{x \rightarrow a} \frac{f(x)}{g(x)} = \lim_{x \rightarrow a} \frac{f'(x)}{g'(x)}\]


\newpage

*** Example 1

Evaluate \(\lim_{x \rightarrow 2} \frac{x^2 - x - 2}{x - 2}\):

\begin{align*}
\lim_{x \rightarrow 2} \frac{x^2 - x - 2}{x - 2} &\neq \frac{2^2 - 2 - 2}{2 - 2} \\
&\neq \frac{0}{0}
\end{align*}

We cannot apply the limit laws directly, so we divide $x^2 - x - 2$ by $x - 2$ using long division, we get:

\begin{align*}
\lim_{x \rightarrow 2} \frac{x^2 - x - 2}{x - 2} &= \lim_{x \rightarrow 2} \frac{(x + 1)(x - 2)}{x - 2} \\
&= \lim_{x \rightarrow 2}(x + 1) \\
&= 2 + 1 \\
&= 3
\end{align*}

*** Example 2
Evaluate \(\lim_{x \rightarrow 1} \frac{\sqrt{2 - x} - 1}{x - 1}\):

\begin{align*}
\lim_{x \rightarrow a} \frac{\sqrt{2 - x} - 1}{x - 1} &\neq \frac{\sqrt{2 - 1} - 1}{1 - 1} \\
&\neq 0
\end{align*}

Once again, we cannot apply the limit laws directly, so we multiply \(\lim_{x \rightarrow 1} \frac{\sqrt{2 - x} - 1}{x - 1}\) by \(\frac{\sqrt{2 - x} + 1}{\sqrt{2 - x} + 1}\)

\begin{align*}
\lim_{x \rightarrow 1} \frac{\sqrt{2 - x} - 1}{x - 1} &= \lim_{x \rightarrow 1} \frac{(\sqrt{2 - x } - 1)(\sqrt{2 - x} + 1)}{(x - 1)(\sqrt{2 - x} + 1)} \\
&= \lim_{x \rightarrow 1} \frac{2 - x - 1}{(x - 1)(\sqrt{2 - x} + 1)} \\
&= \lim_{x \rightarrow 1} \frac{1 - x}{- (1 - x)(\sqrt{2 - x} + 1)} \\
&= \lim_{x \rightarrow 1} \frac{1}{- (\sqrt{2 - x} + 1)} \\
&= -\frac{1}{2}
\end{align*}

*** Incorrect example
$\indent$ The following is *wrong*:

\begin{align*}
\lim_{x \rightarrow a} x \cdot \frac{1}{x} &= \lim_{x \rightarrow 0} x \cdot \lim_{x \rightarrow 0} \frac{1}{x} \\
&= 0 \cdot \lim_{x \rightarrow 0} \frac{1}{x} \\
&= 0
\end{align*}

Instead, we should do this:
\begin{align*}
\lim_{x \rightarrow 0} \cdot \frac{1}{x} &= \lim_{x \rightarrow 0} 1 \\
&= 1
\end{align*}


* Squeeze Theorem
Suppose \(f(x) \leq g(x) \leq h(x)\), for \(x \in I \setminus \{a\}\), where $I$ is some open interval containing the point $a$. Then:

\[\lim_{x \rightarrow a} f(x) = \lim_{x \rightarrow a} h(x) = L \quad \Rightarrow \quad \lim_{x \rightarrow a} g(x) = L\]

\newpage

** Proof

Suppose:
\[f(x) \leq g(x) \leq h(x), \text{ for } x \in I \setminus \{a\} \tag{1}\]
\[\lim_{x \rightarrow a}f(x) = \lim_{x \rightarrow a}h(x) = L \tag{2}\]

Let $\varepsilon > 0$. Since $I$ is open and $a \in I$, there exists a $\delta_1 > 0$ such that $(a - \delta_1, a + \delta_1) \subset I$. And by using equation $(2)$, there exists a $\delta_2, \delta_3 > 0$ such that:

\[0 < |x - a| < \delta_2, \ x \in dom \, f \ \Rightarrow \ |f(x) - L| < \varepsilon \ \Rightarrow \ L - \varepsilon < f(x)\]
\[0 < |x - a| < \delta_3, \ x \in dom \, h \ \Rightarrow \ |h(x) - L| < \varepsilon \ \Rightarrow \ h(x) < L + \epsilon\]

Note that $dom$ represents the *domain* of the function.
\\

Let $\delta = min \{\delta_1, \delta_2, \delta_3\}$. Using equation $(1)$, we get:
\[0 < |x - a| < \delta\]
\[\Downarrow\]
\[x \in I \setminus \{a\}\]
\[0 < |x - a| < \delta_2\]
\[0 < |x - a| < \delta_3\]
\[\Downarrow\]
\[L - \varepsilon < f(x) \leq g(x) \leq h(x) < L + \varepsilon\]
\[\Downarrow\]
\[|g(x) - L| < \varepsilon\]


** Another useful result
For $f : A \rightarrow \mathbb{R}$, we have:
\[\lim_{x \rightarrow a} f(x) = L \quad \Leftrightarrow \quad \lim_{x \rightarrow a} |f(x) - L| = 0\]

*** Proof
\[\lim_{x \rightarrow a} f(x) = L\]
\[\Updownarrow\]
\[\begin{aligned} &\text{For every } \varepsilon > 0, \text{ there exists a } \delta > 0 \\
&\text{such that } 0 < |x - a| < \delta, \ x \in A
\end{aligned} \quad \Rightarrow \quad |f(x) - L| < \varepsilon\]
\[\Updownarrow\]
\[\begin{aligned} &\text{For every } \varepsilon > 0, \text{ there exists a } \delta > 0 \\
&\text{such that } 0 < |x - a| < \delta, \ x \in A
\end{aligned} \quad \Rightarrow \quad ||f(x) - L| - 0| < \varepsilon\]
\[\Updownarrow\]
\[\lim_{x \rightarrow a}|f(x) - L| = 0\]


*** Example 1
Evaluate \(\lim_{x \rightarrow 0} x \sin \frac{1}{x}\) (again):
\\

Guess, from the graph or otherwise: \(\lim_{x \rightarrow 0} x \sin \frac{1}{x} = 0\)
\\

*Proof*:
\\

Note that:
\[\lim_{x \rightarrow 0} x \sin \frac{1}{x} = 0 \quad \Leftrightarrow \quad \lim_{x \rightarrow 0} \left|x \sin \frac{1}{x} - 0 \right| = 0\]

\[0 \leq \left|x \sin \frac{1}{x} \right| = |x| \left|\sin \frac{1}{x} \right| \leq |x|\]

By the squeeze theorem:
\[\lim_{x \rightarrow 0} \left|x \sin \frac{1}{x} \right| = 0\]

Hence:
\[\lim_{x \rightarrow 0} x \sin \frac{1}{x} = 0\]


*** Example 2
Evaluate \(\lim_{x \rightarrow 0} e^{\sin(\cot x)} x^4\)
\\

Guess, from the graph or otherwise: \(\lim_{x \rightarrow 0} e^{\sin(\cot x)} x^4 = 0\)
\\

*Proof*:
\\

By the squeeze theorem,
\[|e^{\sin(\cot x)} x^4 - 0| = e^{\sin(\cot x)} \cdot |x^4|\]

Because the range of \(\sin (\cot x)\) is \(x \in [-1, 1]\), the range of \(e^{\sin (\cot x)}\) will be \(x \in [e^{-1}, e^{1}]\), which is less than \(e\):
\[e^{\sin(\cot x)} \cdot |x^4| \leq e \cdot |x^4|\]
\[e \cdot |x^4| \rightarrow 0 \text{ as } x \rightarrow 0\]

Hence:
\[\lim_{x \rightarrow 0} e^{\sin (\cot x)} x^4 = 0\]


** A lemma

For \(0 < x < \frac{\pi}{2}\), we have:
\[x \cos^2 x < \sin x < x\]

If $f$ and $g$ are *even* functions such that \(f(x) < g(x)\), for $x \in (0, a)$, then we also have:
\[f(x) < g(x), \text{ for } x \in (-a, 0)\]

\newpage

