y1s1/cy1601-math-1/module-1b/notes.tex

\subsubsection{Proof}
\label{sec:org76fada2}

Suppose \(f\) and \(g\) are even and:
\[f(x) < g(x), \text{ for } x \in (0, a)\]

Then for \(x \in (-a, 0)\), let \(u = x\) so \(u \in (0, a)\). We get:
\[f(x) = f(-u) = f(u) < g(u) = g(-u) = g(x)\]

We showed that \(x \cos^2 x < \sin x < x\) for \(x \in (0, \frac{\pi}{2})\).
\\[0pt]

Since \(x > 0\), we get:
\[\cos^2 x < \frac{\sin x}{x} < 1, \text{ for } x \in (0, \frac{\pi}{2})\]

Since all three expressions above are even functions, the two inequalities extend to \((-\frac{\pi}{2}, 0)\). Hence:
\[\cos^2 x < \frac{\sin x}{x} < 1, \text{ for } x \in (- \frac{\pi}{2}, 0) \cup (0, \frac{\pi}{2})\]


\subsubsection{Example 1}
\label{sec:orgc1bc7cf}
Find \(\lim_{x \rightarrow 0} \sin x\):
\\[0pt]

Using the lemma:
\[\frac{\sin x}{x} < 1, \text{ for } x \in (-\frac{\pi}{2}, 0) \cup (0, \frac{\pi}{2})\]

Note that for \(x \in (-\frac{\pi}{2}, 0) \cup (0, \frac{\pi}{2})\), we have:
\[\left|\frac{\sin x}{x} \right| = \frac{\sin x}{x} < 1 \text{ for } x \in (-\frac{\pi}{2}, 0) \cup (0, \frac{\pi}{2})\]

So for \(x \in (-\frac{\pi}{2}, 0) \cup (0, \frac{\pi}{2})\):
\[0 \leq |\sin x| \leq |x|\]

Because by using the squeeze theorem, \(|\sin x|\) approaches 0 and \(|x|\) approaches 0 when x approaches 0.
\\[0pt]

Hence:
\[\lim_{x \rightarrow 0} \sin x = 0\]


\subsubsection{Example 2}
\label{sec:orga2776c2}
Find \(\lim_{x \rightarrow 0} \cos x\):
\\[0pt]

For \(x \in (-\frac{\pi}{2}, 0) \cup (0, \frac{\pi}{2}), \cos x > 0\), so:
\begin{align*}
\cos x &= |\cos x| \\
&= \sqrt{\cos^2 x} \\
&= \sqrt{1 - \sin^2 x}
\end{align*}

Since \(\sin^2 x \rightarrow 0\) as \(x \rightarrow 0\):
\begin{align*}
\sqrt{1 - \sin^2 x} &\rightarrow \sqrt{1} \\
&\rightarrow 1
\end{align*}

Hence:
\[\lim_{x \rightarrow 0} \cos x = 1\]


\subsubsection{Example 3}
\label{sec:org37b8921}
Find \(\lim_{x \rightarrow 0} \frac{\sin x}{x}\):
\\[0pt]

We showed that:
\[\cos^2 x < \frac{\sin x}{x} < 1 \text{ for } x \in (-\frac{\pi}{2}, 0) \cup (0, \frac{\pi}{2})\]

So \(\lim_{x \rightarrow 0} \frac{\sin x}{x} = 1\)


\section{Limits at infinity}
\label{sec:org4a704e2}
We also want to consider a function's behaviour as \(x\) becomes very large (either positive or negative). For example, it is clear that the values of \(f(x) = 4 - \frac{2}{x}\) can be made arbitrarily close to 4 by choosing \(x\) to be large enough.
\\[0pt]

We can express this by writing:
\[\lim_{x \rightarrow + \infty} 4 - \frac{2}{x} = 4\]


\subsection{Definition}
\label{sec:org2c6f293}
Suppose \(f\) is defined on some interval \((a, \infty)\). We say that \(f(x)\) has a limit \(L\) as \(x\) approaches positive infinity, and write \(\lim_{X \rightarrow + \infty} f(x) = L\), if for every \(\varepsilon > 0\), there exists a number \(R\) such that:
\[x > R \quad \Rightarrow \quad |f(x) - L| < \varepsilon\]

Likewise, for \(f\) defined on some interval \((-\infty, b)\), we say that \(f(x)\) has a limit \(L\) as \(x\) approaches negative infinity, and write \(\lim_{x \rightarrow - \infty} f(x) = L\), if for every \(\varepsilon > 0\), there exists a number \(R\) such that:
\[x < R \quad \Rightarrow \quad |f(x) - L| < \varepsilon\]

Limits at infinity follow the same limit laws as normal limits, so we can use limit laws to conclude that for any \textbf{positive} integer \(n\), we also have:
\[\lim_{x \rightarrow \pm \infty} \frac{1}{x^n} = 0\]

When evaluating a limit at infinity, a common technique is to factor out the highest possible power.

\subsection{Example 1}
\label{sec:orgc8e7fc5}
Show that \(\lim_{x \rightarrow + \infty} = 0\).
\\[0pt]

Let \(\varepsilon > 0\) and \(R = \frac{1}{\varepsilon}\). We get:

\begin{align*}
x > R \Rightarrow \left|\frac{1}{x} - 0 \right| &= \frac{1}{|x|} \\
&= \frac{1}{x} \\
&< \frac{1}{R} = \varepsilon
\end{align*}

\[x > R = \frac{1}{\varepsilon} > 0\]

\newpage

\subsection{Example 2}
\label{sec:org64fc32e}
Show that \(\lim_{x \rightarrow - \infty} = 0\).
\\[0pt]

Let \(\varepsilon > 0\) and \(R = \frac{1}{\varepsilon}\). We get:

\begin{align*}
x < R \Rightarrow \left|\frac{1}{x} - 0 \right| &= \frac{1}{|x|} \\
&= \frac{1}{x} \\
&< \frac{1}{R} = \varepsilon
\end{align*}

\[x < R = \frac{1}{\varepsilon} > 0\]

\subsection{Example 3}
\label{sec:org80d99ed}
Find:
\[\lim_{x \rightarrow + \infty} \frac{x^3 + 4x -5}{7x^3 + 3}\]
\\[0pt]

As \(x \rightarrow + \infty\):
\begin{align*}
\frac{x^3 + 4x - 5}{7x^3 + 3} &=
\frac{x^3 \left(1 + \frac{4}{x^2} - \frac{5}{x^3} \right)}
{x^3 \left( 7 + \frac{3}{x^3}\right)} \\
&= \frac{1 + \frac{4}{x^2} - \frac{5}{x^3}}
{7 + \frac{3}{x^3}} \\
&= \frac{1 + \frac{4(1)}{x^2} - \frac{5(1)}{x^3}}
{7 + \frac{3(1)}{x^3}} \\
&\rightarrow \frac{1}{7} \text{ as } x \rightarrow +\infty
\end{align*}

This is because all terms with \(\frac{1}{x^n}\), where \(n \in \mathbb{Z}^+\), approach 0 when \(x \rightarrow + \infty\).
\\[0pt]

Hence:
\[\lim_{x \rightarrow + \infty} \frac{x^3 + 4x -5}{7x^3 + 3} \rightarrow \frac{1}{7} \text{ as } x \rightarrow +\infty\]

\newpage

\subsection{Incorrect example}
\label{sec:org87eb330}
Find:
\[\lim_{x \rightarrow - \infty} \frac{\sqrt{2x^2 + 1}}{3x - 5}\]

\begin{align*}
\frac{\sqrt{2x^2 + 1}}{3x - 5} &=
\frac{\sqrt{x^2 \left(2 + \frac{1}{x^2}\right)}}{x \left(3 - \frac{5}{x} \right)} \\
&= \frac{\sqrt{x^2} \cdot \sqrt{2 + \frac{1}{x^2}}}{x \left(3 - \frac{5}{x} \right)} \\
&= \frac{|x| \sqrt{2 + \frac{1}{x^2}}}{x \left(3 - \frac{5}{x} \right)} \\
&= \frac{x \sqrt{2 + \frac{1}{x^2}}}{x \left(3 - \frac{5}{x} \right)} \\
&= \frac{\sqrt{2 + \frac{1}{x^2}}}{\left(3 - \frac{5}{x} \right)}
\end{align*}

Since \(\frac{1}{x}\) and \(\frac{5}{x}\) approach 0 when \(x \rightarrow \infty\):
\[\frac{\sqrt{2 + \frac{1}{x^2}}}{\left(3 - \frac{5}{x} \right)} \rightarrow \frac{\sqrt{2}}{3} \text{ as } x \rightarrow -\infty\]

\subsubsection{Explanation of why the example is incorrect}
\label{sec:orgb57e602}

\(\indent\) For \(a \ge 0\):
\[x = \sqrt{a} \quad \Leftrightarrow \quad x^2 = a, \ x \ge 0\]

Hence:
\[x = \sqrt{a^2} \quad \Leftrightarrow \quad x^2 = a^2, \ x \ge 0 \quad \Leftrightarrow \quad x = |a|\]
\[\sqrt{a^2} = |a|\]

For example:
\[\sqrt{(-2)^2} = \sqrt{4} = 2 = |-2|\]

The example automatically assumed that \(\sqrt{x^2}\) is \(x\) without considering what \(x\) will be when approaching the limit, as \(x\) in \(\sqrt{x^2}\) can be either \(x\) or \(-x\).

\subsubsection{Important note}
\label{sec:org45738d2}
Do not write \(\sqrt{a^2} = \pm a\), as it is not correct. The square root is a \textbf{function} of its argument and has \textbf{only one} (non-negative) value.
\\[0pt]

For example, the solutions to the equation \(x^2 = a\) for \(a > 0\) are \(x = \pm \sqrt{a}\). Do not write the solution as \(x = \sqrt{a}\) and claim that \(\sqrt{a}\) has both a positive and negative value.

\subsection{Corrected example}
\label{sec:org6b1fec9}
Find:
\[\lim_{x \rightarrow - \infty} \frac{\sqrt{2x^2 + 1}}{3x - 5}\]

\begin{align*}
\frac{\sqrt{2x^2 + 1}}{3x - 5} &=
\frac{\sqrt{x^2 \left(2 + \frac{1}{x^2}\right)}}{x \left(3 - \frac{5}{x} \right)} \\
&= \frac{\sqrt{x^2} \cdot \sqrt{2 + \frac{1}{x^2}}}{x \left(3 - \frac{5}{x} \right)} \\
&= \frac{|x| \sqrt{2 + \frac{1}{x^2}}}{x \left(3 - \frac{5}{x} \right)}
\end{align*}

For \(x < 0\), \(|x| = -x\):
\begin{align*}
\frac{|x| \sqrt{2 + \frac{1}{x^2}}}{x \left(3 - \frac{5}{x} \right)} &=
\frac{-x \sqrt{2 + \frac{1}{x^2}}}{x \left(3 - \frac{5}{x} \right)} \\
&= \frac{- \sqrt{2 + \frac{1}{x^2}}}{3 - \frac{5}{x}}
\end{align*}

Since \(\frac{1}{x^2}\) and \(\frac{1}{x}\) approach 0 as \(x \rightarrow -\infty\):
\[\frac{- \sqrt{2 + \frac{1}{x^2}}}{3 - \frac{5}{x}} \ \rightarrow \ -\frac{\sqrt{2}}{3} \text{ as } x \rightarrow -\infty\]

Hence:
\[\lim_{x \rightarrow - \infty} \frac{\sqrt{2x^2 + 1}}{3x - 5} \rightarrow -\frac{\sqrt{2}}{3} \text{ as } x \rightarrow -\infty\]


\section{Limit of a sequence}
\label{sec:orgcc4af72}

\subsection{Definition}
\label{sec:org218c9df}
We say that a sequence \((a_n)\) has the limit \(L\) and write \(\lim_{n \rightarrow \infty} a_n = L\), if for every \(\varepsilon > 0\), there exists a number \(N\) such that:
\[n > N \quad \Rightarrow \quad |a_n - L| < \varepsilon\]

The limits of sequences are evaluated with similar methods to other forms of limits.

\newpage
