y1s1/cy1601-math-1/module-1b/notes.tex

\subsection{Example}
\label{sec:orgae72cb1}
Find:
\[\lim_{n \rightarrow \infty} (\sqrt{n^2 + 2n} - n)\]

\begin{align*}
\sqrt{n^2 + 2n} - n &= \frac{(\sqrt{n^2 + 2n} - n)(\sqrt{n^2 + 2n} + n)}{\sqrt{n^2 + 2n} + n} \\
&= \frac{n^2 + 2n - n^2}{\sqrt{n^2 + 2n} + n} \\
&= \frac{2n}{\sqrt{n^2 + 2n} + n} \\
&= \frac{2n}{\sqrt{n^2 \left( 1 + \frac{2}{n} \right)} + n} \\
&= \frac{2n}{|n| \cdot \sqrt{1 + \frac{2}{n}}}
\end{align*}

Since \(|n| = n\) for \(n > 0\):
\begin{align*}
\frac{2n}{|n| \cdot \sqrt{1 + \frac{2}{n}}} &= \frac{2n}{n \sqrt{1 + \frac{2}{n}} + n} \\
&= \frac{2n}{n (\sqrt{1 + \frac{2}{n}} + 1)} \\
&= \frac{2}{\sqrt{1 + \frac{2}{n}} + 1}
\end{align*}

Since \(\frac{2}{n} \rightarrow 0\) when \(n \rightarrow \infty\):
\begin{align*}
\frac{2}{\sqrt{1 + \frac{2}{n}} + 1} &\rightarrow \frac{2}{\sqrt{1} + 1} \\
&\rightarrow \frac{2}{2} \\
&\rightarrow 1 \text{ when } n \rightarrow \infty
\end{align*}
\end{document}